torbrodtkorb/alva-master/firmware/pack/edc/AVR32DD32.PIC
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0xB96"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="DITCTRL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0xB98">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="DITHERSEL" edc:nzwidth="0x2" edc:desc="Dither select">
                <edc:SFRFieldSemantic edc:cname="ONTIMEB" edc:desc="On-time ramp B" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ONTIMEAB" edc:desc="On-time ramp A and B" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DEADTIMEB" edc:desc="Dead-time rampB" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DEADTIMEAB" edc:desc="Dead-time ramp A and B" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="DITVAL" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0xB99">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="DITHER" edc:nzwidth="0x4" edc:desc="Dither value"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xB9A"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-----n-n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x5" edc:_addr="0xB9E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug run"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FAULTDET" edc:nzwidth="0x1" edc:desc="Fault detection"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_addr="0xB9F"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="CAPTUREA" edc:nzwidth="0x10" edc:access="rrrrrrrrrrrrrrrr" edc:_addr="0xBA2"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="CAPTUREB" edc:nzwidth="0x10" edc:access="rrrrrrrrrrrrrrrr" edc:_addr="0xBA4"/>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0xBA6"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="CMPASET" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xBA8"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="CMPACLR" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xBAA"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="CMPBSET" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xBAC"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="CMPBCLR" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xBAE"/>
        <edc:AdjustPoint edc:offset="0x351" edc:_addr="0xBB0"/>
        <edc:SFRDef ltx:memberofperipheral="SYSCFG" edc:cname="REVID" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xF01"/>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0xF02"/>
        <edc:SFRDef ltx:memberofperipheral="SYSCFG" edc:cname="OCDMCTRL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xF04"/>
        <edc:SFRDef ltx:memberofperipheral="SYSCFG" edc:cname="OCDMSTATUS" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0xF05">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCFG">
              <edc:SFRFieldDef edc:cname="VALID" edc:nzwidth="0x1" edc:desc="OCD Message Valid"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xFA" edc:_addr="0xF06"/>
        <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:_addr="0x1000">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x7" edc:desc="Command">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Command" edc:when="(field &amp; 0x7F) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="NOOP" edc:desc="No Operation" edc:when="(field &amp; 0x7F) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="FLWR" edc:desc="Flash Write" edc:when="(field &amp; 0x7F) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="FLPER" edc:desc="Flash Page Erase" edc:when="(field &amp; 0x7F) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="FLMPER2" edc:desc="Flash Multi-Page Erase 2 pages" edc:when="(field &amp; 0x7F) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="FLMPER4" edc:desc="Flash Multi-Page Erase 4 pages" edc:when="(field &amp; 0x7F) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="FLMPER8" edc:desc="Flash Multi-Page Erase 8 pages" edc:when="(field &amp; 0x7F) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="FLMPER16" edc:desc="Flash Multi-Page Erase 16 pages" edc:when="(field &amp; 0x7F) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="FLMPER32" edc:desc="Flash Multi-Page Erase 32 pages" edc:when="(field &amp; 0x7F) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="EEWR" edc:desc="EEPROM Write" edc:when="(field &amp; 0x7F) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="EEERWR" edc:desc="EEPROM Erase and Write" edc:when="(field &amp; 0x7F) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="EEBER" edc:desc="EEPROM Byte Erase" edc:when="(field &amp; 0x7F) == 0x18"/>
                <edc:SFRFieldSemantic edc:cname="EEMBER2" edc:desc="EEPROM Multi-Byte Erase 2 bytes" edc:when="(field &amp; 0x7F) == 0x19"/>
                <edc:SFRFieldSemantic edc:cname="EEMBER4" edc:desc="EEPROM Multi-Byte Erase 4 bytes" edc:when="(field &amp; 0x7F) == 0x1A"/>
                <edc:SFRFieldSemantic edc:cname="EEMBER8" edc:desc="EEPROM Multi-Byte Erase 8 bytes" edc:when="(field &amp; 0x7F) == 0x1B"/>
                <edc:SFRFieldSemantic edc:cname="EEMBER16" edc:desc="EEPROM Multi-Byte Erase 16 bytes" edc:when="(field &amp; 0x7F) == 0x1C"/>
                <edc:SFRFieldSemantic edc:cname="EEMBER32" edc:desc="EEPROM Multi-Byte Erase 32 bytes" edc:when="(field &amp; 0x7F) == 0x1D"/>
                <edc:SFRFieldSemantic edc:cname="CHER" edc:desc="Chip Erase Command" edc:when="(field &amp; 0x7F) == 0x20"/>
                <edc:SFRFieldSemantic edc:cname="EECHER" edc:desc="EEPROM Erase Command" edc:when="(field &amp; 0x7F) == 0x30"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="n-nn-nnn" edc:por="00110000" edc:mclr="00110000" edc:impl="0xB7" edc:_addr="0x1001">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="APPCODEWP" edc:nzwidth="0x1" edc:desc="Application Code Write Protect"/>
              <edc:SFRFieldDef edc:cname="BOOTRP" edc:nzwidth="0x1" edc:desc="Boot Read Protect"/>
              <edc:SFRFieldDef edc:cname="APPDATAWP" edc:nzwidth="0x1" edc:desc="Application Data Write Protect"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FLMAP" edc:nzwidth="0x2" edc:desc="Flash Mapping in Data space">
                <edc:SFRFieldSemantic edc:cname="SECTION0" edc:desc="Flash section 0" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SECTION1" edc:desc="Flash section 1" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="SECTION2" edc:desc="Flash section 2" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="SECTION3" edc:desc="Flash section 3" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FLMAPLOCK" edc:nzwidth="0x1" edc:desc="Flash Mapping Lock"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="-rrr--rr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x73" edc:_addr="0x1002">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="FBUSY" edc:nzwidth="0x1" edc:desc="Flash busy"/>
              <edc:SFRFieldDef edc:cname="EEBUSY" edc:nzwidth="0x1" edc:desc="EEPROM busy"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ERROR" edc:nzwidth="0x3" edc:desc="Write error">
                <edc:SFRFieldSemantic edc:cname="NOERROR" edc:desc="No Error" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ILLEGALCMD" edc:desc="Write command not selected" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ILLEGALSADDR" edc:desc="Write to section not allowed" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DOUBLESELECT" edc:desc="Selecting new write command while write command already seleted" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="ONGOINGPROG" edc:desc="Starting a new programming operation before previous is completed" edc:when="(field &amp; 0x7) == 0x04"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="INTCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x1003">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="EEREADY" edc:nzwidth="0x1" edc:desc="EEPROM Ready"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="INTFLAGS" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x1004">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="EEREADY" edc:nzwidth="0x1" edc:desc="EEPROM Ready"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x1005"/>
        <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="DATA" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0x1006"/>
        <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="ADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x1008"/>
      </edc:SFRDataSector>
      <edc:ConfigFuseSector edc:regionid="LOCKBITS" edc:beginaddr="0x1040" edc:endaddr="0x1044" edc:magicoffset="0x830000" atdf:pagesize="0x1" edc:rw="rw">
        <edc:DCRDef ltx:memberofperipheral="LOCK" edc:cname="KEY" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x5CC5C55C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x1040">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCK">
              <edc:DCRFieldDef edc:cname="KEY" edc:nzwidth="0x20" edc:desc="Lock Key">
                <edc:DCRFieldSemantic edc:cname="NOLOCK" edc:desc="No locks" edc:when="(field &amp; 0xFFFFFFFF) == 0x5CC5C55C"/>
                <edc:DCRFieldSemantic edc:cname="RWLOCK" edc:desc="Read and write lock" edc:when="(field &amp; 0xFFFFFFFF) == 0xA33A3AA3"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
      </edc:ConfigFuseSector>
      <edc:ConfigFuseSector edc:regionid="FUSES" edc:beginaddr="0x1050" edc:endaddr="0x1059" edc:magicoffset="0x820000" atdf:pagesize="0x1" edc:rw="rw">
        <edc:DCRDef ltx:memberofperipheral="FUSE" edc:cname="WDTCFG" edc:nzwidth="0x8" edc:impl="0xFF" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x00" edc:access="nnnnnnnn" edc:_addr="0x1050">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="PERIOD" edc:nzwidth="0x4" edc:desc="Watchdog Timeout Period">
                <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watch-Dog timer Off" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="8CLK" edc:desc="8 cycles (8ms)" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="16CLK" edc:desc="16 cycles (16ms)" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="32CLK" edc:desc="32 cycles (32ms)" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:DCRFieldSemantic edc:cname="64CLK" edc:desc="64 cycles (64ms)" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:DCRFieldSemantic edc:cname="128CLK" edc:desc="128 cycles (0.128s)" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:DCRFieldSemantic edc:cname="256CLK" edc:desc="256 cycles (0.256s)" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:DCRFieldSemantic edc:cname="512CLK" edc:desc="512 cycles (0.512s)" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:DCRFieldSemantic edc:cname="1KCLK" edc:desc="1K cycles (1.0s)" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:DCRFieldSemantic edc:cname="2KCLK" edc:desc="2K cycles (2.0s)" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:DCRFieldSemantic edc:cname="4KCLK" edc:desc="4K cycles (4.0s)" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:DCRFieldSemantic edc:cname="8KCLK" edc:desc="8K cycles (8.0s)" edc:when="(field &amp; 0xF) == 0x0B"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="WINDOW" edc:nzwidth="0x4" edc:desc="Watchdog Window Timeout Period">
                <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Window mode off" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="8CLK" edc:desc="8 cycles (8ms)" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="16CLK" edc:desc="16 cycles (16ms)" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="32CLK" edc:desc="32 cycles (32ms)" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:DCRFieldSemantic edc:cname="64CLK" edc:desc="64 cycles (64ms)" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:DCRFieldSemantic edc:cname="128CLK" edc:desc="128 cycles (0.128s)" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:DCRFieldSemantic edc:cname="256CLK" edc:desc="256 cycles (0.256s)" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:DCRFieldSemantic edc:cname="512CLK" edc:desc="512 cycles (0.512s)" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:DCRFieldSemantic edc:cname="1KCLK" edc:desc="1K cycles (1.0s)" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:DCRFieldSemantic edc:cname="2KCLK" edc:desc="2K cycles (2.0s)" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:DCRFieldSemantic edc:cname="4KCLK" edc:desc="4K cycles (4.0s)" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:DCRFieldSemantic edc:cname="8KCLK" edc:desc="8K cycles (8.0s)" edc:when="(field &amp; 0xF) == 0x0B"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef ltx:memberofperipheral="FUSE" edc:cname="BODCFG" edc:nzwidth="0x8" edc:impl="0xFF" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x00" edc:access="nnnnnnnn" edc:_addr="0x1051">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="SLEEP" edc:nzwidth="0x2" edc:desc="BOD Operation in Sleep Mode">
                <edc:DCRFieldSemantic edc:cname="DISABLE" edc:desc="BOD disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="ENABLE" edc:desc="BOD enabled in continuous mode" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="SAMPLE" edc:desc="BOD enabled in sampled mode" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="ACTIVE" edc:nzwidth="0x2" edc:desc="BOD Operation in Active Mode">
                <edc:DCRFieldSemantic edc:cname="DISABLE" edc:desc="BOD disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="ENABLE" edc:desc="BOD enabled in continuous mode" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="SAMPLE" edc:desc="BOD enabled in sampled mode" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="ENABLEWAIT" edc:desc="BOD enabled in continuous mode. Execution is halted at wake-up until BOD is running." edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="SAMPFREQ" edc:nzwidth="0x1" edc:desc="BOD Sample Frequency">
                <edc:DCRFieldSemantic edc:cname="128Hz" edc:desc="Sample frequency is 128 Hz" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="32Hz" edc:desc="Sample frequency is 32 Hz" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="LVL" edc:nzwidth="0x3" edc:desc="BOD Level">
                <edc:DCRFieldSemantic edc:cname="BODLEVEL0" edc:desc="1.9V" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL1" edc:desc="2.45V" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL2" edc:desc="2.7V" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL3" edc:desc="2.85V" edc:when="(field &amp; 0x7) == 0x03"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef ltx:memberofperipheral="FUSE" edc:cname="OSCCFG" edc:nzwidth="0x8" edc:impl="0x7" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x00" edc:access="-----nnn" edc:_addr="0x1052">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="CLKSEL" edc:nzwidth="0x3" edc:desc="Frequency Select">
                <edc:DCRFieldSemantic edc:cname="OSCHF" edc:desc="1-32MHz internal oscillator" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="OSC32K" edc:desc="32.768kHz internal oscillator" edc:when="(field &amp; 0x7) == 0x01"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
